NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.c
    /* PORT1_20 (pin K5) is configured as FC4_P0 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD3_SDA_PORT, BOARD_INITPINS_SMB_SSD3_SDA_PIN, kPORT_MuxAlt3);

    PORT1->PCR[20] = ((PORT1->PCR[20] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_21 (pin L5) is configured as FC4_P1 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD3_SCL_PORT, BOARD_INITPINS_SMB_SSD3_SCL_PIN, kPORT_MuxAlt3);

    PORT1->PCR[21] = ((PORT1->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_22 (pin L4) is configured as ADC1_A22 */
    PORT_SetPinMux(BOARD_INITPINS_VMON_12V_SSD4_DIV_PORT, BOARD_INITPINS_VMON_12V_SSD4_DIV_PIN, kPORT_MuxAlt0);

    PORT1->PCR[22] = ((PORT1->PCR[22] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_23 (pin M4) is configured as ADC1_A23 */
    PORT_SetPinMux(BOARD_INITPINS_VMON_12V_SSD5_DIV_PORT, BOARD_INITPINS_VMON_12V_SSD5_DIV_PIN, kPORT_MuxAlt0);

    PORT1->PCR[23] = ((PORT1->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_3 (pin B4) is configured as ADC0_A19 */
    PORT_SetPinMux(BOARD_INITPINS_VMON_12V_SSD3_DIV_PORT, BOARD_INITPINS_VMON_12V_SSD3_DIV_PIN, kPORT_MuxAlt0);

    PORT1->PCR[3] = ((PORT1->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_4 (pin A4) is configured as FC5_P0 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD4_SDA_PORT, BOARD_INITPINS_SMB_SSD4_SDA_PIN, kPORT_MuxAlt3);

    PORT1->PCR[4] = ((PORT1->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_5 (pin B3) is configured as FC5_P1 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD4_SCL_PORT, BOARD_INITPINS_SMB_SSD4_SCL_PIN, kPORT_MuxAlt3);

    PORT1->PCR[5] = ((PORT1->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_6 (pin B2) is configured as PIO1_6 */
    PORT_SetPinMux(BOARD_INITPINS_VPP_CPU1B_ALERT_PORT, BOARD_INITPINS_VPP_CPU1B_ALERT_PIN, kPORT_MuxAlt0);

    PORT1->PCR[6] = ((PORT1->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT1_7 (pin A2) is configured as PIO1_7 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_SSD0_EN_N_PORT, BOARD_INITPINS_CLK_SSD0_EN_N_PIN, kPORT_MuxAlt0);

    PORT1->PCR[7] = ((PORT1->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_0 (pin H2) is configured as PIO2_0 */
    PORT_SetPinMux(BOARD_INITPINS_SSD4_PRSNT_L_PORT, BOARD_INITPINS_SSD4_PRSNT_L_PIN, kPORT_MuxAlt0);

    PORT2->PCR[0] = ((PORT2->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_1 (pin H1) is configured as PIO2_1 */
    PORT_SetPinMux(BOARD_INITPINS_SSD5_PRSNT_L_PORT, BOARD_INITPINS_SSD5_PRSNT_L_PIN, kPORT_MuxAlt0);

    PORT2->PCR[1] = ((PORT2->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_10 (pin M3) is configured as PIO2_10 */
    PORT_SetPinMux(BOARD_INITPINS_SSD6_LED_PORT, BOARD_INITPINS_SSD6_LED_PIN, kPORT_MuxAlt0);

    PORT2->PCR[10] = ((PORT2->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_11 (pin N4) is configured as PIO2_11 */
    PORT_SetPinMux(BOARD_INITPINS_SSD7_LED_PORT, BOARD_INITPINS_SSD7_LED_PIN, kPORT_MuxAlt0);

    PORT2->PCR[11] = ((PORT2->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_2 (pin H3) is configured as PIO2_2 */
    PORT_SetPinMux(BOARD_INITPINS_SSD6_PRSNT_L_PORT, BOARD_INITPINS_SSD6_PRSNT_L_PIN, kPORT_MuxAlt0);

    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_3 (pin J3) is configured as FC9_P1 */
    PORT_SetPinMux(BOARD_INITPINS_VPP_CPU1_SCL_PORT, BOARD_INITPINS_VPP_CPU1_SCL_PIN, kPORT_MuxAlt2);

    PORT2->PCR[3] = ((PORT2->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_4 (pin K3) is configured as FC9_P0 */
    PORT_SetPinMux(BOARD_INITPINS_VPP_CPU1_SDA_PORT, BOARD_INITPINS_VPP_CPU1_SDA_PIN, kPORT_MuxAlt2);

