NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.c
    PORT2->PCR[4] = ((PORT2->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_5 (pin K1) is configured as PIO2_5 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_SSD7_EN_N_PORT, BOARD_INITPINS_CLK_SSD7_EN_N_PIN, kPORT_MuxAlt0);

    PORT2->PCR[5] = ((PORT2->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_6 (pin K2) is configured as PIO2_6 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_SSD5_EN_N_PORT, BOARD_INITPINS_CLK_SSD5_EN_N_PIN, kPORT_MuxAlt0);

    PORT2->PCR[6] = ((PORT2->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_7 (pin L2) is configured as PIO2_7 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_SSD4_EN_N_PORT, BOARD_INITPINS_CLK_SSD4_EN_N_PIN, kPORT_MuxAlt0);

    PORT2->PCR[7] = ((PORT2->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_8 (pin M2) is configured as PIO2_8 */
    PORT_SetPinMux(BOARD_INITPINS_SSD4_LED_PORT, BOARD_INITPINS_SSD4_LED_PIN, kPORT_MuxAlt0);

    PORT2->PCR[8] = ((PORT2->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_9 (pin M1) is configured as PIO2_9 */
    PORT_SetPinMux(BOARD_INITPINS_SSD5_LED_PORT, BOARD_INITPINS_SSD5_LED_PIN, kPORT_MuxAlt0);

    PORT2->PCR[9] = ((PORT2->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_0 (pin B17) is configured as PIO3_0 */
    PORT_SetPinMux(BOARD_INITPINS_SSD0_PWRDIS_PORT, BOARD_INITPINS_SSD0_PWRDIS_PIN, kPORT_MuxAlt0);

    PORT3->PCR[0] = ((PORT3->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_1 (pin C15) is configured as PIO3_1 */
    PORT_SetPinMux(BOARD_INITPINS_SSD1_PWRDIS_PORT, BOARD_INITPINS_SSD1_PWRDIS_PIN, kPORT_MuxAlt0);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_10 (pin F17) is configured as PIO3_10 */
    PORT_SetPinMux(BOARD_INITPINS_CLK_SSD3_EN_N_PORT, BOARD_INITPINS_CLK_SSD3_EN_N_PIN, kPORT_MuxAlt0);

    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin F16) is configured as PIO3_11 */
    PORT_SetPinMux(BOARD_INITPINS_SSD7_PWRDIS_PORT, BOARD_INITPINS_SSD7_PWRDIS_PIN, kPORT_MuxAlt0);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_12 (pin G16) is configured as PIO3_12 */
    PORT_SetPinMux(BOARD_INITPINS_SSD01_PWRBRK_PORT, BOARD_INITPINS_SSD01_PWRBRK_PIN, kPORT_MuxAlt0);

    PORT3->PCR[12] = ((PORT3->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_13 (pin H16) is configured as PIO3_13 */
    PORT_SetPinMux(BOARD_INITPINS_VPP_CPU0_ALERT_PORT, BOARD_INITPINS_VPP_CPU0_ALERT_PIN, kPORT_MuxAlt0);

    PORT3->PCR[13] = ((PORT3->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_14 (pin H17) is configured as FC8_P0 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD5_SDA_PORT, BOARD_INITPINS_SMB_SSD5_SDA_PIN, kPORT_MuxAlt2);

    PORT3->PCR[14] = ((PORT3->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_15 (pin H15) is configured as FC8_P1 */
    PORT_SetPinMux(BOARD_INITPINS_SMB_SSD5_SCL_PORT, BOARD_INITPINS_SMB_SSD5_SCL_PIN, kPORT_MuxAlt2);

    PORT3->PCR[15] = ((PORT3->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_16 (pin J15) is configured as PIO3_16 */
    PORT_SetPinMux(BOARD_INITPINS_SSD0_LED_PORT, BOARD_INITPINS_SSD0_LED_PIN, kPORT_MuxAlt0);

    PORT3->PCR[16] = ((PORT3->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_17 (pin K15) is configured as PIO3_17 */
    PORT_SetPinMux(BOARD_INITPINS_SSD4_PWRDIS_PORT, BOARD_INITPINS_SSD4_PWRDIS_PIN, kPORT_MuxAlt0);

    PORT3->PCR[17] = ((PORT3->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_18 (pin K16) is configured as PIO3_18 */
    PORT_SetPinMux(BOARD_INITPINS_SSD1_LED_PORT, BOARD_INITPINS_SSD1_LED_PIN, kPORT_MuxAlt0);

    PORT3->PCR[18] = ((PORT3->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_19 (pin K17) is configured as PIO3_19 */
    PORT_SetPinMux(BOARD_INITPINS_SSD23_PWRBRK_PORT, BOARD_INITPINS_SSD23_PWRBRK_PIN, kPORT_MuxAlt0);

