NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.c
                     /* Pin Multiplex Control: PORT5_6 (pin K13) is configured as PIO5_6. */
                     | PORT_PCR_MUX(PORT5_PCR_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    PORT5->PCR[7] = ((PORT5->PCR[7] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT5_7 (pin L13) is configured as PIO5_7. */
                     | PORT_PCR_MUX(PORT5_PCR_MUX_mux00)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    GPIO1->ICR[16] = ((GPIO1->ICR[16] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    GPIO1->ICR[17] = ((GPIO1->ICR[17] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    GPIO2->ICR[0] = ((GPIO2->ICR[0] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    GPIO2->ICR[1] = ((GPIO2->ICR[1] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    GPIO2->ICR[2] = ((GPIO2->ICR[2] &
                      /* Mask bits to zero which are setting */
                      (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                     /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                     | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    GPIO4->ICR[21] = ((GPIO4->ICR[21] &
                       /* Mask bits to zero which are setting */
                       (~(GPIO_ICR_IRQS_MASK | GPIO_ICR_ISF_MASK)))

                      /* Interrupt Select: Interrupt, trigger output, or DMA request 0. */
                      | GPIO_ICR_IRQS(ICR_IRQS_irqs0));

    gpio_pin_config_t SSD0_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin E11)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_PERST_L_GPIO, BOARD_INITPINS_SSD0_PERST_L_PIN, &SSD0_PERST_L_config);

    gpio_pin_config_t SSD1_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin G13)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_PERST_L_GPIO, BOARD_INITPINS_SSD1_PERST_L_PIN, &SSD1_PERST_L_config);

    gpio_pin_config_t SSD4_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin C10)  */
    GPIO_PinInit(BOARD_INITPINS_SSD4_PERST_L_GPIO, BOARD_INITPINS_SSD4_PERST_L_PIN, &SSD4_PERST_L_config);

    gpio_pin_config_t SSD2_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin C9)  */
    GPIO_PinInit(BOARD_INITPINS_SSD2_PERST_L_GPIO, BOARD_INITPINS_SSD2_PERST_L_PIN, &SSD2_PERST_L_config);

    gpio_pin_config_t SSD5_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin B7)  */
    GPIO_PinInit(BOARD_INITPINS_SSD5_PERST_L_GPIO, BOARD_INITPINS_SSD5_PERST_L_PIN, &SSD5_PERST_L_config);

    gpio_pin_config_t SSD3_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin E8)  */
    GPIO_PinInit(BOARD_INITPINS_SSD3_PERST_L_GPIO, BOARD_INITPINS_SSD3_PERST_L_PIN, &SSD3_PERST_L_config);

    gpio_pin_config_t SSD6_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin F8)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_PERST_L_GPIO, BOARD_INITPINS_SSD6_PERST_L_PIN, &SSD6_PERST_L_config);

    gpio_pin_config_t SSD7_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin C4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD7_PERST_L_GPIO, BOARD_INITPINS_SSD7_PERST_L_PIN, &SSD7_PERST_L_config);

    gpio_pin_config_t VPP_CPU1B_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_6 (pin B2)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO, BOARD_INITPINS_VPP_CPU1B_ALERT_PIN, &VPP_CPU1B_ALERT_config);

    gpio_pin_config_t CLK_SSD0_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_7 (pin A2)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD0_EN_N_GPIO, BOARD_INITPINS_CLK_SSD0_EN_N_PIN, &CLK_SSD0_EN_N_config);

    gpio_pin_config_t VPP_CPU1_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin C3)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU1_ALERT_GPIO, BOARD_INITPINS_VPP_CPU1_ALERT_PIN, &VPP_CPU1_ALERT_config);

    gpio_pin_config_t SSD67_PWRBRK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_11 (pin D3)  */
    GPIO_PinInit(BOARD_INITPINS_SSD67_PWRBRK_GPIO, BOARD_INITPINS_SSD67_PWRBRK_PIN, &SSD67_PWRBRK_config);

    gpio_pin_config_t CLK_SSD1_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_14 (pin D4)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD1_EN_N_GPIO, BOARD_INITPINS_CLK_SSD1_EN_N_PIN, &CLK_SSD1_EN_N_config);

    gpio_pin_config_t SSD6_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_15 (pin E4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_PWRDIS_GPIO, BOARD_INITPINS_SSD6_PWRDIS_PIN, &SSD6_PWRDIS_config);

