NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.c
    gpio_pin_config_t SSD0_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_16 (pin F6)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_PRSNT_L_GPIO, BOARD_INITPINS_SSD0_PRSNT_L_PIN, &SSD0_PRSNT_L_config);

    gpio_pin_config_t SSD1_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_17 (pin F4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_PRSNT_L_GPIO, BOARD_INITPINS_SSD1_PRSNT_L_PIN, &SSD1_PRSNT_L_config);

    gpio_pin_config_t V_SSD5_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin G4)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD5_DIS_GPIO, BOARD_INITPINS_V_SSD5_DIS_PIN, &V_SSD5_DIS_config);

    gpio_pin_config_t V_SSD6_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_19 (pin G5)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD6_DIS_GPIO, BOARD_INITPINS_V_SSD6_DIS_PIN, &V_SSD6_DIS_config);

    gpio_pin_config_t SSD4_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_0 (pin H2)  */
    GPIO_PinInit(BOARD_INITPINS_SSD4_PRSNT_L_GPIO, BOARD_INITPINS_SSD4_PRSNT_L_PIN, &SSD4_PRSNT_L_config);

    gpio_pin_config_t SSD5_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_1 (pin H1)  */
    GPIO_PinInit(BOARD_INITPINS_SSD5_PRSNT_L_GPIO, BOARD_INITPINS_SSD5_PRSNT_L_PIN, &SSD5_PRSNT_L_config);

    gpio_pin_config_t SSD6_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_2 (pin H3)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_PRSNT_L_GPIO, BOARD_INITPINS_SSD6_PRSNT_L_PIN, &SSD6_PRSNT_L_config);

    gpio_pin_config_t CLK_SSD7_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin K1)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD7_EN_N_GPIO, BOARD_INITPINS_CLK_SSD7_EN_N_PIN, &CLK_SSD7_EN_N_config);

    gpio_pin_config_t CLK_SSD5_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_6 (pin K2)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD5_EN_N_GPIO, BOARD_INITPINS_CLK_SSD5_EN_N_PIN, &CLK_SSD5_EN_N_config);

    gpio_pin_config_t CLK_SSD4_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_7 (pin L2)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD4_EN_N_GPIO, BOARD_INITPINS_CLK_SSD4_EN_N_PIN, &CLK_SSD4_EN_N_config);

    gpio_pin_config_t SSD4_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_8 (pin M2)  */
    GPIO_PinInit(BOARD_INITPINS_SSD4_LED_GPIO, BOARD_INITPINS_SSD4_LED_PIN, &SSD4_LED_config);

    gpio_pin_config_t SSD5_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_9 (pin M1)  */
    GPIO_PinInit(BOARD_INITPINS_SSD5_LED_GPIO, BOARD_INITPINS_SSD5_LED_PIN, &SSD5_LED_config);

    gpio_pin_config_t SSD6_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_10 (pin M3)  */
    GPIO_PinInit(BOARD_INITPINS_SSD6_LED_GPIO, BOARD_INITPINS_SSD6_LED_PIN, &SSD6_LED_config);

    gpio_pin_config_t SSD7_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_11 (pin N4)  */
    GPIO_PinInit(BOARD_INITPINS_SSD7_LED_GPIO, BOARD_INITPINS_SSD7_LED_PIN, &SSD7_LED_config);

    gpio_pin_config_t SSD0_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_0 (pin B17)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_PWRDIS_GPIO, BOARD_INITPINS_SSD0_PWRDIS_PIN, &SSD0_PWRDIS_config);

    gpio_pin_config_t SSD1_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_1 (pin C15)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_PWRDIS_GPIO, BOARD_INITPINS_SSD1_PWRDIS_PIN, &SSD1_PWRDIS_config);

    gpio_pin_config_t SSD2_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_4 (pin F14)  */
    GPIO_PinInit(BOARD_INITPINS_SSD2_PWRDIS_GPIO, BOARD_INITPINS_SSD2_PWRDIS_PIN, &SSD2_PWRDIS_config);

    gpio_pin_config_t SSD45_PWRBRK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_5 (pin G14)  */
    GPIO_PinInit(BOARD_INITPINS_SSD45_PWRBRK_GPIO, BOARD_INITPINS_SSD45_PWRBRK_PIN, &SSD45_PWRBRK_config);

    gpio_pin_config_t SSD3_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_6 (pin D17)  */
    GPIO_PinInit(BOARD_INITPINS_SSD3_PWRDIS_GPIO, BOARD_INITPINS_SSD3_PWRDIS_PIN, &SSD3_PWRDIS_config);

    gpio_pin_config_t CLK_SSD2_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_7 (pin D14)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD2_EN_N_GPIO, BOARD_INITPINS_CLK_SSD2_EN_N_PIN, &CLK_SSD2_EN_N_config);

    gpio_pin_config_t SSD5_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_8 (pin E14)  */
    GPIO_PinInit(BOARD_INITPINS_SSD5_PWRDIS_GPIO, BOARD_INITPINS_SSD5_PWRDIS_PIN, &SSD5_PWRDIS_config);

    gpio_pin_config_t SSD3_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_9 (pin F15)  */
    GPIO_PinInit(BOARD_INITPINS_SSD3_LED_GPIO, BOARD_INITPINS_SSD3_LED_PIN, &SSD3_LED_config);

    gpio_pin_config_t CLK_SSD3_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_10 (pin F17)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD3_EN_N_GPIO, BOARD_INITPINS_CLK_SSD3_EN_N_PIN, &CLK_SSD3_EN_N_config);

    gpio_pin_config_t SSD7_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_11 (pin F16)  */
    GPIO_PinInit(BOARD_INITPINS_SSD7_PWRDIS_GPIO, BOARD_INITPINS_SSD7_PWRDIS_PIN, &SSD7_PWRDIS_config);

    gpio_pin_config_t SSD01_PWRBRK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_12 (pin G16)  */
    GPIO_PinInit(BOARD_INITPINS_SSD01_PWRBRK_GPIO, BOARD_INITPINS_SSD01_PWRBRK_PIN, &SSD01_PWRBRK_config);

    gpio_pin_config_t VPP_CPU0_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_13 (pin H16)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU0_ALERT_GPIO, BOARD_INITPINS_VPP_CPU0_ALERT_PIN, &VPP_CPU0_ALERT_config);

