NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.c
    gpio_pin_config_t SSD0_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_16 (pin J15)  */
    GPIO_PinInit(BOARD_INITPINS_SSD0_LED_GPIO, BOARD_INITPINS_SSD0_LED_PIN, &SSD0_LED_config);

    gpio_pin_config_t SSD4_PWRDIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin K15)  */
    GPIO_PinInit(BOARD_INITPINS_SSD4_PWRDIS_GPIO, BOARD_INITPINS_SSD4_PWRDIS_PIN, &SSD4_PWRDIS_config);

    gpio_pin_config_t SSD1_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_18 (pin K16)  */
    GPIO_PinInit(BOARD_INITPINS_SSD1_LED_GPIO, BOARD_INITPINS_SSD1_LED_PIN, &SSD1_LED_config);

    gpio_pin_config_t SSD23_PWRBRK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_19 (pin K17)  */
    GPIO_PinInit(BOARD_INITPINS_SSD23_PWRBRK_GPIO, BOARD_INITPINS_SSD23_PWRBRK_PIN, &SSD23_PWRBRK_config);

    gpio_pin_config_t VPP_CPU0B_ALERT_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO3_22 (pin M16)  */
    GPIO_PinInit(BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO, BOARD_INITPINS_VPP_CPU0B_ALERT_PIN, &VPP_CPU0B_ALERT_config);

    gpio_pin_config_t SSD2_LED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_23 (pin M15)  */
    GPIO_PinInit(BOARD_INITPINS_SSD2_LED_GPIO, BOARD_INITPINS_SSD2_LED_PIN, &SSD2_LED_config);

    gpio_pin_config_t SSD7_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_0 (pin P1)  */
    GPIO_PinInit(BOARD_INITPINS_SSD7_PRSNT_L_GPIO, BOARD_INITPINS_SSD7_PRSNT_L_PIN, &SSD7_PRSNT_L_config);

    gpio_pin_config_t CLK_SSD6_EN_N_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_1 (pin P2)  */
    GPIO_PinInit(BOARD_INITPINS_CLK_SSD6_EN_N_GPIO, BOARD_INITPINS_CLK_SSD6_EN_N_PIN, &CLK_SSD6_EN_N_config);

    gpio_pin_config_t V_SSD3_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin U1)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD3_DIS_GPIO, BOARD_INITPINS_V_SSD3_DIS_PIN, &V_SSD3_DIS_config);

    gpio_pin_config_t PCIE_SSD5_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_14 (pin N8)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD5_PERST_L_PIN, &PCIE_SSD5_PERST_L_config);

    gpio_pin_config_t PCIE_SSD6_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_16 (pin R8)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD6_PERST_L_PIN, &PCIE_SSD6_PERST_L_config);

    gpio_pin_config_t PCIE_SSD7_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_17 (pin R9)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD7_PERST_L_PIN, &PCIE_SSD7_PERST_L_config);

    gpio_pin_config_t V_SSD2_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_18 (pin N10)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD2_DIS_GPIO, BOARD_INITPINS_V_SSD2_DIS_PIN, &V_SSD2_DIS_config);

    gpio_pin_config_t V_SSD4_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_20 (pin T10)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD4_DIS_GPIO, BOARD_INITPINS_V_SSD4_DIS_PIN, &V_SSD4_DIS_config);

    gpio_pin_config_t SSD2_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_21 (pin T11)  */
    GPIO_PinInit(BOARD_INITPINS_SSD2_PRSNT_L_GPIO, BOARD_INITPINS_SSD2_PRSNT_L_PIN, &SSD2_PRSNT_L_config);

    gpio_pin_config_t SSD3_PRSNT_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_22 (pin T12)  */
    GPIO_PinInit(BOARD_INITPINS_SSD3_PRSNT_L_GPIO, BOARD_INITPINS_SSD3_PRSNT_L_PIN, &SSD3_PRSNT_L_config);

    gpio_pin_config_t V_SSD7_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_23 (pin U12)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD7_DIS_GPIO, BOARD_INITPINS_V_SSD7_DIS_PIN, &V_SSD7_DIS_config);

    gpio_pin_config_t PCIE_SSD0_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_0 (pin U16)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD0_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD0_PERST_L_PIN, &PCIE_SSD0_PERST_L_config);

    gpio_pin_config_t PCIE_SSD1_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_1 (pin U17)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD1_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD1_PERST_L_PIN, &PCIE_SSD1_PERST_L_config);

    gpio_pin_config_t PCIE_SSD4_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_2 (pin M10)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD4_PERST_L_PIN, &PCIE_SSD4_PERST_L_config);

    gpio_pin_config_t PCIE_SSD3_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_3 (pin N11)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD3_PERST_L_PIN, &PCIE_SSD3_PERST_L_config);

    gpio_pin_config_t PCIE_SSD2_PERST_L_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_4 (pin M12)  */
    GPIO_PinInit(BOARD_INITPINS_PCIE_SSD2_PERST_L_GPIO, BOARD_INITPINS_PCIE_SSD2_PERST_L_PIN, &PCIE_SSD2_PERST_L_config);

    gpio_pin_config_t CLKSEL_MODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_5 (pin K12)  */
    GPIO_PinInit(BOARD_INITPINS_CLKSEL_MODE_GPIO, BOARD_INITPINS_CLKSEL_MODE_PIN, &CLKSEL_MODE_config);

    gpio_pin_config_t V_SSD0_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_6 (pin K13)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD0_DIS_GPIO, BOARD_INITPINS_V_SSD0_DIS_PIN, &V_SSD0_DIS_config);

    gpio_pin_config_t V_SSD1_DIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO5_7 (pin L13)  */
    GPIO_PinInit(BOARD_INITPINS_V_SSD1_DIS_GPIO, BOARD_INITPINS_V_SSD1_DIS_PIN, &V_SSD1_DIS_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
